Tekla Open API Reference for Tekla Structures 2025
BoltCatalogStandard Class
 The BoltCatalogStandard class represents a control to select the bolt standard using the bolt catalog.
 Bolt catalog controls always need to be in pairs, meaning in every dialog there has to be a BoltCatalogStandard and a BoltCatalogSize control.
 The property BoltCatalogStandard.LinkedBoltCatalogSize sets to which BoltCatalogSize the control is linked.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ListControl
 System.Windows.Forms.ComboBox
 Tekla.Structures.Dialog.UIControls.BoltCatalogStandard
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class BoltCatalogStandard : ComboBox
Public Class BoltCatalogStandard
	Inherits ComboBox
The BoltCatalogStandard type exposes the following members.
Constructors
Name | Description
BoltCatalogStandard
 Initiates a new instance of the control.
Top
Properties
Name | Description
LinkedBoltCatalogSize
 The BoltCatalogSize control linked to the BoltCatalogStandard control. Bolt catalog controls always need to be in pairs, meaning in every dialog there has to be a BoltCatalogStandard and a BoltCatalogSize control.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace